<?php
defined('BASEPATH') OR exit('No direct script access allowed');
###################################################################
#
#
#                       _oo0oo_
#                      o8888888o
#                      88" . "88
#                      (| -_- |)
#                      0\  =  /0
#                    ___/`---'\___
#                  .' \\|     |// '.
#                 / \\|||  :  |||// \
#                / _||||| -:- |||||- \
#               |   | \\\  -  /// |   |
#               | \_|  ''\---/''  |_/ |
#               \  .-\__  '-'  ___/-. /
#             ___'. .'  /--.--\  `. .'___
#          ."" '<  `.___\_<|>_/___.' >' "".
#         | | :  `- \`.;`\ _ /`;.`/ - ` : | |
#         \  \ `_.   \_ __\ /__ _/   .-` /  /
#     =====`-.____`.___ \_____/___.-`___.-'=====
#                       `=---='
#
#
#     ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
#
#               佛祖保佑         永無BUG
#
###################################################################
class Welcome extends CI_Controller {

    public function __construct() {
        parent::__construct();
        #載入必Load項目
        $this->load->helper("Common_Helper");
    }

    /**
     * 返回系統線上狀態
     *
     * @return void
     */
    public function index() {
        json_respon(['code' => '0000', 'message' => 'system is work.']);
    }
}